In [2]:
import numpy as np
import pandas as pd

In [2]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)

In [3]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

### 21. For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

In [4]:
df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')

visits    1    2    3
animal
cat     2.5  NaN  2.5
dog     3.0  6.0  NaN
snake   4.5  0.5  NaN

22. You have a DataFrame df with a column 'A' of integers. For example:

`df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})`
How do you filter out rows which contain the same integer as the row immediately above?

You should be left with a column containing the following values:

In [5]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})

In [6]:
df

    A
0   1
1   2
2   2
3   3
4   4
5   5
6   5
7   5
8   6
9   7
10  7

In [7]:
df.drop_duplicates(subset='A')

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [9]:
df = pd.DataFrame({'A': [1, 1, 2, 2, 1, 1] })
df.drop_duplicates(subset='A')

   A
0  1
2  2

### 23. Given a DataFrame of random numeric values:

`df = pd.DataFrame(np.random.random(size=(5, 3)))` 

this is a 5x3 DataFrame of float values. how do you subtract the row mean from each element in the row?

In [11]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.618225  0.649240  0.087497
1  0.742358  0.092098  0.332776
2  0.437076  0.561704  0.425105
3  0.768719  0.283877  0.220744
4  0.082727  0.328146  0.858453

In [12]:
df.mean(axis=1)

0    0.451654
1    0.389078
2    0.474628
3    0.424447
4    0.423109
dtype: float64

In [14]:
df.sub(df.mean(axis=1), axis=0)

          0         1         2
0  0.166571  0.197586 -0.364157
1  0.353281 -0.296979 -0.056301
2 -0.037552  0.087076 -0.049524
3  0.344272 -0.140570 -0.203703
4 -0.340382 -0.094963  0.435345

In [15]:
df.sub(df.mean(axis=1), axis=1) # default value of axis is 1 or 'columns'

          0         1         2   3   4
0  0.166571  0.260162 -0.387131 NaN NaN
1  0.290704 -0.296979 -0.141852 NaN NaN
2 -0.014578  0.172626 -0.049524 NaN NaN
3  0.317065 -0.105201 -0.253885 NaN NaN
4 -0.368927 -0.060932  0.383825 NaN NaN

### 24. Suppose you have DataFrame with 10 columns of real numbers, for example:

`df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))`

Which column of numbers has the smallest sum? Return that column's label.

In [16]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df

,a,b,c,d,e,f,g,h,i,j
0,0.219659,0.690018,0.301809,0.540412,0.041835,0.046848,0.556363,0.250247,0.615642,0.453132
1,0.597411,0.427615,0.745849,0.173258,0.603250,0.223161,0.283427,0.766689,0.889985,0.853691
2,0.614094,0.602674,0.131644,0.411010,0.904339,0.407425,0.476343,0.631460,0.817040,0.130020
3,0.321425,0.995785,0.663689,0.643146,0.876235,0.319660,0.372731,0.060286,0.444451,0.075770
4,0.361511,0.724839,0.618324,0.106302,0.465349,0.790799,0.264282,0.493458,0.891107,0.916173

In [20]:
df.sum(axis=0)

a    2.114100
b    3.440932
c    2.461314
d    1.874128
e    2.891008
f    1.787893
g    1.953146
h    2.202140
i    3.658225
j    2.428786
dtype: float64

In [19]:
df.sum(axis=0).idxmin()

'f'

### 25. How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?

In [25]:
df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
df

   0  1  2
0  0  0  0
1  0  0  1
2  0  1  1
3  1  0  1
4  0  1  0
5  1  0  0
6  1  1  0
7  0  1  0
8  1  1  0
9  0  0  0

In [26]:
len(df)

10

In [27]:
df.duplicated(keep=False)

0     True
1    False
2    False
3    False
4     True
5    False
6     True
7     True
8     True
9     True
dtype: bool

**df.duplicated 에서 keep인자가 하는 역할은?**

[df.duplicated documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.duplicated.html)
```
keep{‘first’, ‘last’, False}, default ‘first’
Determines which duplicates (if any) to mark.

first : Mark duplicates as True except for the first occurrence.

last : Mark duplicates as True except for the last occurrence.

False : Mark all duplicates as True.
```

**df.drop_duplicated 에서 keep 인자가 하는 역할은?**

[df.drop_duplicates documentation](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop_duplicates.html)

```
keep{‘first’, ‘last’, False}, default ‘first’
Determines which duplicates (if any) to keep. - first : Drop duplicates except for the first occurrence. - last : Drop duplicates except for the last occurrence. - False : Drop all duplicates.
```

결론. 처음 걸 남길 건지, 마지막 걸 남길 건지 결정하기 위해 사용되는 인자. False면 모든 걸 drop한다.

In [28]:
df.duplicated(keep=False).sum()

6

In [29]:
len(df) - df.duplicated(keep=False).sum()

4

In [30]:
len(df.drop_duplicates(keep=False))

4

### 26. In the cell below, you have a DataFrame df that consists of 10 columns of floating-point numbers. Exactly 5 entries in each row are NaN values.

For each row of the DataFrame, find the column which contains the third NaN value.

You should return a Series of column labels: e, c, d, h, d

In [15]:
nan = np.nan

data = [[0.04,  nan,  nan, 0.25,  nan, 0.43, 0.71, 0.51,  nan,  nan],
        [ nan,  nan,  nan, 0.04, 0.76,  nan,  nan, 0.67, 0.76, 0.16],
        [ nan,  nan, 0.5 ,  nan, 0.31, 0.4 ,  nan,  nan, 0.24, 0.01],
        [0.49,  nan,  nan, 0.62, 0.73, 0.26, 0.85,  nan,  nan,  nan],
        [ nan,  nan, 0.41,  nan, 0.05,  nan, 0.61,  nan, 0.48, 0.68]]

columns = list('abcdefghij')

df = pd.DataFrame(data, columns=columns)

# write a solution to the question here
df

      a   b     c     d     e     f     g     h     i     j
0  0.04 NaN   NaN  0.25   NaN  0.43  0.71  0.51   NaN   NaN
1   NaN NaN   NaN  0.04  0.76   NaN   NaN  0.67  0.76  0.16
2   NaN NaN  0.50   NaN  0.31  0.40   NaN   NaN  0.24  0.01
3  0.49 NaN   NaN  0.62  0.73  0.26  0.85   NaN   NaN   NaN
4   NaN NaN  0.41   NaN  0.05   NaN  0.61   NaN  0.48  0.68

In [18]:
df.isnull()

       a     b      c      d      e      f      g      h      i      j
0  False  True   True  False   True  False  False  False   True   True
1   True  True   True  False  False   True   True  False  False  False
2   True  True  False   True  False  False   True   True  False  False
3  False  True   True  False  False  False  False   True   True   True
4   True  True  False   True  False   True  False   True  False  False